Revit 2027 API
BendingDetailLevelOfDetail Enumeration
 Describes the level of detail in which the Bending Detail will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailLevelOfDetail
Public Enumeration BendingDetailLevelOfDetail
public enum class BendingDetailLevelOfDetail
type BendingDetailLevelOfDetail
Members
Member name | Value | Description
ByView | 0 |  The level detail is taken from the view.
Coarse | 1 |  Centerline representation of the Bending Detail.
Fine | 2 |  Ribbon representation of Bending Detail.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace